//====================================//
// インクルード
//====================================//
#include "battery.h"
//====================================//
// グローバル変数の宣言
//====================================//
uint16_t batteryval;
/////////////////////////////////////////////////////////////////////
// モジュール名 GetBatterytADVal
// 処理概要     バッテリーのAD値を取得
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void GetBatterytADVal(void)
{
	GET_BATTERY_VAL;	// バッテリー電圧値の取得
}
