//====================================//
// インクルード
//====================================//
#include "battery.h"
//====================================//
// グローバル変数の宣言
//====================================//
uint16_t batteryval;
float batteryVoltage;
/////////////////////////////////////////////////////////////////////
// モジュール名 GetBatteryADVal
// 処理概要     バッテリーのAD値取得と電圧計算
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void GetBatteryADVal(void)
{
	GET_BATTERY_VAL;	// バッテリー電圧値の取得
    batteryVoltage = (float)batteryval * 12.0F / 4095.0F; // 電圧計算
}
