//====================================//
// インクルード
//====================================//
#include "encoder.h"
//====================================//
// グローバル変数の宣言
//====================================//
int16_t encCurrent = 0;
int32_t encTotal = 0;

// 外部変数
int32_t enc1;				// 走行用距離カウント
int32_t enc_slope;			// 坂上距離カウント
/////////////////////////////////////////////////////////////////////
// モジュール名 Encoderinit
// 処理概要     ロータリエンコーダの初期化処理
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void InitEncoder(void)
{
	R_Config_MTU2_Start();
}
/////////////////////////////////////////////////////////////////////
// モジュール名 getEncoder
// 処理概要     1ms間のエンコーダカウントを算出する
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void GetEncoderVal(void)
{
	uint16_t encRaw = 0;
	static uint16_t encBuf = 0;

	// エンコーダカウントを取得
	encRaw = MTU_CHANNEL.TCNT;

	// 1msあたりのカウント
	encCurrent = encBuf - encRaw;
	// カウントの積算
	encTotal += encCurrent;
	enc1 += encCurrent;
	enc_slope += encCurrent;
	// 前回値を更新
	encBuf = encRaw;
}
///////////////////////////////////////////////////////////////////////////
// モジュール名 encMM
// 処理概要     mmをエンコーダのパルス数に変換して返す
// 引数         mm:変換する長さ[mm]
// 戻り値       変換したパルス数
///////////////////////////////////////////////////////////////////////////
int32_t encMM(uint16_t mm)
{
	return PULSE_MILLIMETER * mm;
}