//====================================//
// インクルード
//====================================//
#include "encoder.h"
//====================================//
// グローバル変数の宣言
//====================================//
int16_t encCurrent = 0;
int32_t encTotal = 0;

// 外部変数
int32_t enc1 = 0;
int32_t encRightMarker = 0;
int32_t encCurve = 0;
/////////////////////////////////////////////////////////////////////
// モジュール名 Encoderinit
// 処理概要     ロータリエンコーダの初期化処理
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void Encoderinit(void)
{
	R_Config_MTU2_Start();
}
/////////////////////////////////////////////////////////////////////
// モジュール名 getEncoder
// 処理概要     1ms間のエンコーダカウントを算出する
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void Encodergetval(void)
{
	uint16_t encRaw = 0;
	static uint16_t encBuf = 0;

	// エンコーダカウントを取得
	encRaw = MTU_CHANNEL.TCNT;

	// 1msあたりのカウント
	encCurrent = encRaw - encBuf;
	// カウントの積算
	encTotal += encCurrent;
	// 前回値を更新
	encBuf = encRaw;
}
///////////////////////////////////////////////////////////////////////////
// モジュール名 encMM
// 処理概要     mmをエンコーダのパルス数に変換して返す
// 引数         mm:変換する長さ[mm]
// 戻り値       変換したパルス数
///////////////////////////////////////////////////////////////////////////
int32_t encMM(int16_t mm)
{
	return PALSE_MILLIMETER * abs(mm);
}