#ifndef TIME_H_
#define TIME_H_
//=====================================//
// インクルード
//=====================================//
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
//=====================================//
// シンボル定義
//=====================================//

//====================================//
// グローバル変数の宣言
//====================================//
extern uint16_t cnt0;
extern uint16_t cnt1;
extern bool initIMU;
extern volatile bool update_display;
//====================================//
// プロトタイプ宣言
//====================================//
void interrupt1ms(void);

#endif // TIME_H_