//====================================//
// インクルード
//====================================//
#include "timer.h"
//====================================//
// グローバル変数の宣言
//====================================//
uint16_t cnt10 = 0;
uint16_t cnt0 = 0;
/////////////////////////////////////////////////////////////////////
// モジュール名 Interrupt1ms
// 処理概要     タイマー割り込み(1ms)
// 引数         なし
// 戻り値       なし
/////////////////////////////////////////////////////////////////////
void Interrupt1ms(void)
{
	cnt0++;
	cnt10++;

	

	switch (cnt10)
	{
	case 1:
		
		BMI088_getGyro(); // 角速度取得
		calcDegrees();	 // 角度計算
		
		break;
	case 10:
		cnt10 = 0;
		break;
	}
}
